<a href="https://colab.research.google.com/github/arumlim/eileen/blob/master/1204%E1%84%89%E1%85%AD%E1%84%91%E1%85%B5%E1%86%BC%E1%84%86%E1%85%A9%E1%86%AF_%E1%84%83%E1%85%A6%E1%84%8B%E1%85%B5%E1%84%90%E1%85%A5_%E1%84%87%E1%85%AE%E1%86%AB%E1%84%89%E1%85%A5%E1%86%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 경고(worning) 비표시
import warnings
warnings.filterwarnings('ignore')

# 쇼핑몰_데이터_분석

### Read Data

In [ ]:
import pandas as pd
customer_master = pd.read_csv('customer_master.csv')
customer_master.head()

  customer_id customer_name registration_date  ... age       birth   pref
0    IK152942           김서준   2019-01-01 0:25  ...  29  1990-06-10  대전광역시
1    TS808488           김예준   2019-01-01 1:13  ...  33  1986-05-20  인천광역시
2    AS834628           김도윤   2019-01-01 2:00  ...  63  1956-01-02  광주광역시
3    AS345469           김시우   2019-01-01 4:48  ...  74  1945-03-25  인천광역시
4    GD892565           김주원   2019-01-01 4:54  ...  54  1965-08-05  울산광역시

[5 rows x 8 columns]

#### item_master.csv, transaction_1.csv, transaction_2.csv, transaction_detail_1.csv, transaction_detail_2.csv  를 Read 해보세요.

In [ ]:
item_master = pd.read_csv('item_master.csv')
transaction_1 = pd.read_csv('transaction_1.csv')
transaction_2 =pd.read_csv('transaction_2.csv')
transaction_detail_1 =pd.read_csv('transaction_detail_1.csv')
transaction_detail_2 =pd.read_csv('transaction_detail_2.csv')

In [ ]:
item_master.head()

  item_id item_name  item_price
0    S001      PC-A       50000
1    S002      PC-B       85000
2    S003      PC-C      120000
3    S004      PC-D      180000
4    S005      PC-E      210000

In [ ]:
transaction_1.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [ ]:
transaction_2.head()

  transaction_id   price         payment_date customer_id
0    T0000005113  295000  2019-06-15 07:20:27    TS169261
1    T0000005114   50000  2019-06-15 07:35:47    HI599892
2    T0000005115   85000  2019-06-15 07:56:36    HI421757
3    T0000005116   50000  2019-06-15 08:40:55    OA386378
4    T0000005117  120000  2019-06-15 08:44:23    TS506913

In [ ]:
transaction_detail_1.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

### Concat

In [ ]:
transaction = pd.concat([transaction_1, transaction_2], ignore_index=True) # ignore_index 인덱스를 새롭게 설정한다.
transaction.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

#### transaction_datail_1과 transaction_detail_2를 concat을 활용하여 결합해 보세요.

In [ ]:
transaction_detail = pd.concat([transaction_detail_1,transaction_detail_2], ignore_index=True)
transaction_detail.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [ ]:
transaction_detail.loc[4990:5010,:]

      detail_id transaction_id item_id  quantity
4990       4990    T0000004860    S004         1
4991       4991    T0000004861    S005         1
4992       4992    T0000004862    S001         2
4993       4993    T0000004863    S005         1
4994       4994    T0000004864    S005         1
4995       4995    T0000004865    S003         1
4996       4996    T0000004866    S001         3
4997       4997    T0000004867    S001         3
4998       4998    T0000004868    S005         1
4999       4999    T0000004869    S003         1
5000       5000    T0000004870    S002         3
5001       5001    T0000004871    S003         1
5002       5002    T0000004872    S001         2
5003       5003    T0000004873    S004         1
5004       5004    T0000004874    S003         2
5005       5005    T0000004875    S002         2
5006       5006    T0000004875    S005         1
5007       5007    T0000004876    S004         1
5008       5008    T0000004877    S005         1
5009       5009    T0000004878    S002         1
5010       5010    T0000004879    S005         1

### Merge

In [ ]:
join_data = pd.merge(transaction_detail, transaction[["transaction_id", "payment_date", "customer_id"]], 
                     on="transaction_id", how="left")
join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
2          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120
3          3    T0000000116    S005         1  2019-02-01 02:47:23    IK452215
4          4    T0000000117    S002         2  2019-02-01 04:33:46    PL542865

In [ ]:
print(len(transaction_detail))
print(len(transaction))
print(len(join_data))

7144
6786
7144

In [ ]:

join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
2          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120
3          3    T0000000116    S005         1  2019-02-01 02:47:23    IK452215
4          4    T0000000117    S002         2  2019-02-01 04:33:46    PL542865

In [ ]:
customer_master.head()

  customer_id customer_name registration_date  ... age       birth   pref
0    IK152942           김서준   2019-01-01 0:25  ...  29  1990-06-10  대전광역시
1    TS808488           김예준   2019-01-01 1:13  ...  33  1986-05-20  인천광역시
2    AS834628           김도윤   2019-01-01 2:00  ...  63  1956-01-02  광주광역시
3    AS345469           김시우   2019-01-01 4:48  ...  74  1945-03-25  인천광역시
4    GD892565           김주원   2019-01-01 4:54  ...  54  1965-08-05  울산광역시

[5 rows x 8 columns]

In [ ]:
join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
2          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120
3          3    T0000000116    S005         1  2019-02-01 02:47:23    IK452215
4          4    T0000000117    S002         2  2019-02-01 04:33:46    PL542865

#### join_data(구매정보, 구매 상세정보)와 customer_master(고객 데이터), item_master(아이템 데이터) 를 merge함수를 사용하여 결합해보세요.

SyntaxError: ignored

In [ ]:
join_data

      detail_id transaction_id  ...         payment_date  customer_id
0             0    T0000000113  ...  2019-02-01 01:36:57     PL563502
1             1    T0000000114  ...  2019-02-01 01:37:23     HD678019
2             2    T0000000115  ...  2019-02-01 02:34:19     HD298120
3             3    T0000000116  ...  2019-02-01 02:47:23     IK452215
4             4    T0000000117  ...  2019-02-01 04:33:46     PL542865
...         ...            ...  ...                  ...          ...
7139       7139    T0000006894  ...  2019-07-31 21:20:44     HI400734
7140       7140    T0000006895  ...  2019-07-31 21:52:48     AS339451
7141       7141    T0000006896  ...  2019-07-31 23:35:25     OA027325
7142       7142    T0000006897  ...  2019-07-31 23:39:35     TS624738
7143       7143    T0000006898  ...  2019-07-31 23:41:38     AS834214

[7144 rows x 6 columns]

#### Create Column

In [ ]:
join_data["price"] = join_data["quantity"] * join_data["item_price"]
join_data[["quantity", "item_price","price"]].head()

KeyError: ignored

In [ ]:
print(join_data["price"].sum())
print(transaction["price"].sum())

KeyError: ignored

In [ ]:
join_data["price"].sum() == transaction["price"].sum()

#### Check Missing Value

In [ ]:
join_data.isnull().sum()

detail_id         0
transaction_id    0
item_id           0
quantity          0
payment_date      0
customer_id       0
dtype: int64

#### Describe

In [ ]:
join_data.describe()

#### 데이터 전처리(데이터 타입 변경)

In [ ]:
join_data["payment_date"] = pd.to_datetime(join_data["payment_date"])
join_data["payment_month"] = join_data["payment_date"].dt.strftime("%Y%m")
join_data[["payment_date", "payment_month"]].head()

In [ ]:
join_data['payment_date']

In [ ]:
join_data["payment_date"] = pd.to_datetime(join_data["payment_date"])
join_data["payment_month"] = join_data["payment_date"].dt.strftime("%Y%m")
join_data[["payment_date", "payment_month"]].head()

#### Groupby

In [ ]:
join_data.groupby("payment_month").sum()["price"]

#### 1. 성별에 따른 매출 총합을 비교하고 어떤 성별이 매출이 더 높은지 구해보세요.

#### 2. 태어난 년도(birth) 별 매출을 구해보세요.

#### 여러개의 칼럼을 groupby 해보자

In [ ]:
join_data.groupby(["payment_month","item_name"]).sum()[["price", "quantity"]]

### pivot_table

In [ ]:
pd.pivot_table(join_data, index='item_name', columns='payment_month', values=['price', 'quantity'], aggfunc='sum')

### Visualize

In [ ]:
graph_data = pd.pivot_table(join_data, index='payment_month', columns='item_name', values='price', aggfunc='sum')
graph_data.head()

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline
plt.plot(list(graph_data.index), graph_data["PC-A"], label='PC-A')
plt.plot(list(graph_data.index), graph_data["PC-B"], label='PC-B')
plt.plot(list(graph_data.index), graph_data["PC-C"], label='PC-C')
plt.plot(list(graph_data.index), graph_data["PC-D"], label='PC-D')
plt.plot(list(graph_data.index), graph_data["PC-E"], label='PC-E')
plt.legend()